const SR_LATN_TABLE: Record<string, string> = {
    "А": "A", "а": "a", "Б": "B", "б": "b", "В": "V", "в": "v", "Г": "G", "г": "g",
    "Д": "D", "д": "d", "Ђ": "Đ", "ђ": "đ", "Е": "E", "е": "e", "Ж": "Ž", "ж": "ž",
    "З": "Z", "з": "z", "И": "I", "и": "i", "Ј": "J", "ј": "j", "К": "K", "к": "k",
    "Л": "L", "л": "l", "Љ": "Lj", "љ": "lj", "М": "M", "м": "m", "Н": "N", "н": "n",
    "Њ": "Nj", "њ": "nj", "О": "O", "о": "o", "П": "P", "п": "p", "Р": "R", "р": "r",
    "С": "S", "с": "s", "Т": "T", "т": "t", "Ћ": "Ć", "ћ": "ć", "У": "U", "у": "u",
    "Ф": "F", "ф": "f", "Х": "H", "х": "h", "Ц": "C", "ц": "c", "Ч": "Č", "ч": "č",
    "Џ": "Dž", "џ": "dž", "Ш": "Š", "ш": "š",
    "Ё": "Jo", "ё": "jo", "Й": "J", "й": "j", "Щ": "Šč", "щ": "šč", "Ъ": "", "ъ": "",
    "Ы": "Y", "ы": "y", "Ь": "'", "ь": "'", "Э": "E", "э": "e", "Ю": "Ju", "ю": "ju",
    "Я": "Ja", "я": "ja", "Ў": "Ŭ", "ў": "ŭ", "Є": "Je", "є": "je", "І": "I", "і": "i",
    "Ї": "Ï", "ї": "ï", "Ґ": "G", "ґ": "g", "Ѕ": "Dz", "ѕ": "dz", "Ѓ": "Ǵ", "ѓ": "ǵ",
    "Ќ": "Ḱ", "ќ": "ḱ"
};

const AZ_LATN_TABLE: Record<string, string> = {
    ...SR_LATN_TABLE,
    "Ҹ": "C", "ҹ": "c", "Ә": "Ə", "ә": "ə", "Ғ": "Ğ", "ғ": "ğ", "Һ": "H", "һ": "h",
    "Ө": "Ö", "ө": "ö", "Ҝ": "G", "ҝ": "g", "Ү": "Ü", "ү": "ü",
    "Ч": "Ç", "ч": "ç", "Х": "X", "х": "x", "Ы": "I", "ы": "ı", "И": "İ", "и": "i",
    "Ж": "J", "ж": "j", "Ј": "Y", "ј": "y", "Г": "Q", "г": "q", "Ш": "Ş", "ш": "ş"
};

export function transliterate(type: 'sr-Latn' | 'az-Latn', text: string): string {
    const table = type === 'sr-Latn' ? SR_LATN_TABLE : AZ_LATN_TABLE;
    return text.split('').map(char => table[char] ?? char).join('');
}
